# Създаваме празна опашка, в която ще съхраняваме имената на клиентите.
queue = []

# Започваме безкраен цикъл, за да чакаме вход от потребителя.
while True:
    # Четем входната команда от потребителя.
    command = input()
    
    # Проверяваме дали въведената команда е "END".
    if command == "END":
        # Изчисляваме броя на останалите хора в опашката.
        remaining_people = len(queue)
        # Извеждаме съобщението с броя на останалите хора.
        print(f"{remaining_people} people remaining.")
        # Прекратяваме цикъла и завършваме програмата.
        break
    # Проверяваме дали въведената команда е "PAID".
    elif command == "PAID":
        # Изваждаме и извеждаме имената на клиентите в опашката и изчистваме опашката.
        while queue:
            print(queue.pop(0))
    else:
        # Ако входната команда не е "END" или "PAID", тя се добавя към опашката.
        queue.append(command)
